# UVPoint Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Reference..::..UVPoint Property
Reference Class See Also
---
The UV parameters of the reference, if the reference contains a face.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public UV UVPoint { get; }
```

Visual Basic
---
```text
Public ReadOnly Property UVPoint As UV
	Get
```

Visual C++
---
```text
public:
property UV^ UVPoint {
	UV^ get ();
}
```

# Remarks
This value is valid only for references of type REFERENCE_TYPE_SURFACE. It is nullNothingnullptra null reference (Nothing in Visual Basic) for all other types.
# See Also
Reference Class
Autodesk.Revit.DB Namespace